{
  "general": "ผู้ช่วยศาสตราจารย์ ดร.วุฒิพงษ์ ชินศรี (โค้ชเณร) เป็นอาจารย์อยู่ที่มหาวิทยาลัยรังสิต มีตำแหน่งบริหารคือ ผู้ช่วยอธิการบดีฝ่ายนวัตกรรมและวิสาหกิจ และ ผู้อำนวยการศูนย์บริการทางวิชาการ ",
  "doing1": "สอนและให้คำแนะนำด้านเทคโนโลยีดิจิทัล การเขียนโปรแกรม การพัฒนาระบบ สตาร์ทอัพ",
  "doing2": "เป็นที่ปรึกษาให้กับหน่วยงานต่าง ๆ ทั้งภาครัฐและเอกชน เกี่ยวกับการประยุกต์ใช้เทคโนโลยีดิจิทัล",
  "doing3": "ออกแบบและพัฒนาระบบสารสนเทศ เพื่อช่วยเพิ่มประสิทธิภาพหรือแก้ปัญหาให้กับหน่วยงาน",
  "doing4": "ผู้เขียนหนังสือ Practical Building A Powerful LINE Official Account",

  "education1": "ปริญญาเอก ปรัชญาดุษฎีบัณฑิต (คอมพิวเตอร์ศึกษา) มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ",
  "education2": "ปริญญาโท วิทยาศาสตรมหาบัณฑิต (เทคโนโลยีสารสนเทศ) สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง",
  "education3": "ปริญญาตรี (เกียรตินิยมอันดับ 1) วิทยาศาสตรบัณฑิต (การจัดการสารสนเทศ) มหาวิทยาลัยรังสิต",

  "contact1": "Facebook: https://www.facebook.com/c.wutthipong",
  "contact2": "YouTube: https://www.youtube.com/@CoachNain/videos",
  "contact3": "Website: https://wutthipong.info",

  "award1": "เครื่องราชอิสริยาภรณ์อันเป็นที่สรรเสริญยิ่งดิเรกคุณาภรณ์ ชั้นที่ 5 เบญจมดิเรกคุณาภรณ์",
  "award2": "ผู้บริหารดีเด่น มหาวิทยาลัยรังสิต",
  "award3": "อาจารย์สอนดีเด่น 3 ปี ติดต่อกัน มหาวิทยาลัยรังสิต",
  "award4": "LINE Certified Coach for API 2023",
  "award5": "Certified Lead Auditor for ISO/IEC29110",

  "project1": "โครงการการจัดทำข้อเสนอเชิงนโยบายการพัฒนา Digital Platform สำนักงานเลขาธิการสภาการศึกษา",
  "project2": "โครงการพัฒนาโปรแกรมประยุกต์สำหรับอุปกรณ์เคลื่อนที่ สำนักงานเลขาธิการสภาการศึกษา",
  "project3": "โครงการอบรมนักวิชาการคอมพิวเตอร์และพนักงานคอมพิวเตอร์ประจำหน่วยงานศาลยุติธรรมทั่วประเทศ สถาบันพัฒนาข้าราชการฝ่ายตุลาการ ศาลยุติธรรม",
  "project4": "โครงการอบรมความรู้ด้านระบบเทคโนโลยีสารสนเทศสำหรับนักวิชาการคอมพิวเตอร์บรรจุใหม่ สถาบันพัฒนาข้าราชการฝ่ายตุลาการ ศาลยุติธรรม",

  "course1": "หลักสูตรการสร้าง Chatbot ช่วยตอบคำถามใน LINE Official Account ใช้ Chatbot เพื่อลดภาระให้กับ Admin",
  "course2": "หลักสูตรการสร้าง Chatbot ด้วย ChatGPT สำหรับตอบคำถามจากข้อมูลที่กำหนด",
  "course3": "โครงการอบรมเชิงปฏิบัติการ “เปลี่ยนตัวเองให้เป็น LINE Developer เพื่อพัฒนา LINE OA ที่เหนือกว่า",

  "book1": [
    {
      "title": "Practical Building A Powerful LINE Official Account",
      "introduction": "ปัจจุบันการพัฒนาระบบต่าง ๆ เพื่อใช้งานร่วมกับ LINE สามารถทำได้อย่างหลากหลาย เช่น พัฒนาในรูปแบบ Chatbot โดยใช้ Messaging API, พัฒนาในรูปแบบของของเว็บไซต์ โดยใช้ LIFF (LINE Front-end Framework) ซึ่งจะมี WebView ที่สามารถรันเว็บไซต์อยู่ภายในแอป LINE ได้โดยตรง, พัฒนาเพื่อใช้งานร่วมกับอุปกรณ์สำหรับส่งข้อมูลระยะสั้นโดยใช้ LINE Beacon, การพัฒนาระบบแจ้งเตือนเหตุการณ์ต่างๆ โดยใช้ LINE Notify",
      "topic1": "LINE ได้ให้บริการ Messaging API สำหรับใช้พัฒนา Chatbot ซึ่งการทำงานของ Messaging API จะอนุญาตให้มีการรับส่งข้อมูลระหว่าง Chatbot กับ LINE Platform ซึ่งจะต้องส่งผ่าน HTTPS (Hypertext Transfer Protocol Secure) ในรูปแบบของ JSON",
      "topic2": "LINE Login เป็นบริการที่ช่วยให้ระบบที่พัฒนาขึ้นสามารถยืนยันตัวตนผู้ใช้งานได้ด้วย LINE Account ซึ่งทำให้ผู้ใช้งาน LINE ทุกคนสามารถทำการยืนยันตัวตนในการเข้าใช้งานระบบได้สะดวก",
      "topic3": "LIFF (LINE Front-end Framework) ช่วยเราสามารถนำเว็บไซต์ที่มีอยู่แล้วมาแสดงผลผ่าน LIFF ซึ่งเป็น WebView ที่สามารถรันเว็บไซต์อยู่ภายในแอป LINE ได้โดยตรง",
      "topic4": "LINE Beacon เป็นเทคโนโลยีที่ช่วยให้ อุปกรณ์ Beacon ติดต่อสื่อสารกับ LINE Platform ได้ ซึ่งหากผู้ที่มี LINE Official Account เปิดใช้งาน Bluetooth และ Location เมื่อเข้าไปอยู่ในรัศมีของ Beacon จะมีการส่งสัญญาณให้ LINE ทราบว่ามีผู้ใช้งานเข้ามาในบริเวณนั้น",
      "topic5": "LINE Notify เป็น LINE Official Account แบบพิเศษที่ทาง LINE มีไว้เพื่อให้บริการการแจ้งเตือน โดย LINE มี APIs ให้นักพัฒนาสามารถนำไปใช้เพื่อสั่งให้ LINE Notify ส่งข้อความในรูปแบบต่างๆ ไปยัง LINE Account หรือ LINE Group ได้ "
    }
  ]
}